<?php

return [

    /*
    |--------------------------------------------------------------------------
    | 订单有效期
    |--------------------------------------------------------------------------
    |
    | 超过有效期的订单会被自动取消，单位：分钟
    |
    */

    'validity' => env('ORDER_CANCEL_VALIDITY', '15'),

    'cancelOrderReason' => [
        1 => '客户现在不想购买',
        2 => '客户商品价格较贵',
        3 => '客户价格波动',
        4 => '客户商品缺货',
        5 => '客户重复下单',
        6 => '客户订单商品选择有误',
        7 => '客户支付方式选择有误',
        8 => '客户收货信息填写有误',
        9 => '客户发票信息填写有误',
        10 => '客户无法支付订单',
        11 => '客户长时间未付款',
        12 => '客户其他原因',
    ],

    'appPayType' => [
        '00' => '未知',
        '01' => '微信正扫',
        '02' => '支付宝正扫',
        '03' => '银联正扫',
        '05' => '微信公众号',
        '06' => '支付宝小程序/生活号',
        '07' => '微信小程序',
        '08' => '微信正扫（直连）',
        '09' => '微信app支付（直连）',
        '10' => '银联app支付',
        '11' => 'apple支付',
        '12' => '微信H5支付（直连）',
        '13' => '支付宝app支付',
    ],

    'hfpayOrderStatus' => [
        'refunding' => '退款中',
        'pay' => '支付成功',
        'refundsuccess' => '退款成功',
        'refundfail' => '退款失败',
    ],
];
